{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            128
          ],
          "dtype": "int32",
          "sparse": false,
          "ragged": false,
          "name": "input_ids"
        },
        "registered_name": null,
        "name": "input_ids",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            128
          ],
          "dtype": "int32",
          "sparse": false,
          "ragged": false,
          "name": "attention_mask"
        },
        "registered_name": null,
        "name": "attention_mask",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            128
          ],
          "dtype": "int32",
          "sparse": false,
          "ragged": false,
          "name": "token_type_ids"
        },
        "registered_name": null,
        "name": "token_type_ids",
        "inbound_nodes": []
      },
      {
        "module": "transformers.models.bert.modeling_tf_bert",
        "class_name": "TFBertModel",
        "config": {
          "return_dict": false,
          "output_hidden_states": false,
          "output_attentions": false,
          "torchscript": false,
          "torch_dtype": null,
          "use_bfloat16": false,
          "tf_legacy_loss": false,
          "pruned_heads": {},
          "tie_word_embeddings": true,
          "is_encoder_decoder": false,
          "is_decoder": false,
          "cross_attention_hidden_size": null,
          "add_cross_attention": false,
          "tie_encoder_decoder": false,
          "max_length": 20,
          "min_length": 0,
          "do_sample": false,
          "early_stopping": false,
          "num_beams": 1,
          "num_beam_groups": 1,
          "diversity_penalty": 0.0,
          "temperature": 1.0,
          "top_k": 50,
          "top_p": 1.0,
          "typical_p": 1.0,
          "repetition_penalty": 1.0,
          "length_penalty": 1.0,
          "no_repeat_ngram_size": 0,
          "encoder_no_repeat_ngram_size": 0,
          "bad_words_ids": null,
          "num_return_sequences": 1,
          "chunk_size_feed_forward": 0,
          "output_scores": false,
          "return_dict_in_generate": false,
          "forced_bos_token_id": null,
          "forced_eos_token_id": null,
          "remove_invalid_values": false,
          "exponential_decay_length_penalty": null,
          "suppress_tokens": null,
          "begin_suppress_tokens": null,
          "architectures": [
            "BertForMaskedLM"
          ],
          "finetuning_task": null,
          "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
          },
          "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
          },
          "tokenizer_class": null,
          "prefix": null,
          "bos_token_id": null,
          "pad_token_id": 0,
          "eos_token_id": null,
          "sep_token_id": null,
          "decoder_start_token_id": null,
          "task_specific_params": null,
          "problem_type": null,
          "_name_or_path": "bert-base-uncased",
          "transformers_version": "4.35.0",
          "gradient_checkpointing": false,
          "model_type": "bert",
          "vocab_size": 30522,
          "hidden_size": 768,
          "num_hidden_layers": 12,
          "num_attention_heads": 12,
          "hidden_act": "gelu",
          "intermediate_size": 3072,
          "hidden_dropout_prob": 0.1,
          "attention_probs_dropout_prob": 0.1,
          "max_position_embeddings": 512,
          "type_vocab_size": 2,
          "initializer_range": 0.02,
          "layer_norm_eps": 1e-12,
          "position_embedding_type": "absolute",
          "use_cache": true,
          "classifier_dropout": null
        },
        "registered_name": "TFBertModel",
        "name": "tf_bert_model",
        "inbound_nodes": [
          [
            [
              "input_ids",
              0,
              0,
              {
                "attention_mask": [
                  "attention_mask",
                  0,
                  0
                ],
                "token_type_ids": [
                  "token_type_ids",
                  0,
                  0
                ]
              }
            ]
          ]
        ]
      },
      {
        "module": "keras.src.layers.core.tf_op_layer",
        "class_name": "SlicingOpLambda",
        "config": {
          "name": "tf.__operators__.getitem",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.getitem"
        },
        "registered_name": "SlicingOpLambda",
        "build_config": {
          "input_shape": [
            null,
            128,
            768
          ]
        },
        "name": "tf.__operators__.getitem",
        "inbound_nodes": [
          [
            "tf_bert_model",
            0,
            0,
            {
              "slice_spec": [
                {
                  "start": null,
                  "stop": null,
                  "step": null
                },
                0,
                {
                  "start": null,
                  "stop": null,
                  "step": null
                }
              ]
            }
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            768
          ]
        },
        "name": "dropout",
        "inbound_nodes": [
          [
            [
              "tf.__operators__.getitem",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 192,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            768
          ]
        },
        "name": "dense",
        "inbound_nodes": [
          [
            [
              "dropout",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            192
          ]
        },
        "name": "dense_1",
        "inbound_nodes": [
          [
            [
              "dense",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_ids",
        0,
        0
      ],
      [
        "attention_mask",
        0,
        0
      ],
      [
        "token_type_ids",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_1",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.14.0",
  "backend": "tensorflow"
}